ezois_ka/oooezoiskaobmen/src/Reports/ДокументыЭДОБЗКСотрудников/ДокументыЭДОБЗКСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДокументыЭДОБЗКСотрудников</name>
</mdclass:Report>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ПодписиДокументовЭДОБЗК/ПодписиДокументовЭДОБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписиДокументовЭДОБЗК</name>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.РезультатыСогласованияБЗК</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ДокументЭДОБЗК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/КомментарииФайловДокументовЭДОБЗК/КомментарииФайловДокументовЭДОБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииФайловДокументовЭДОБЗК</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКомментария</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/ДокументЭДОБЗК/ДокументЭДОБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументЭДОБЗК</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОбъектСПечатнымиФормами</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснованиеДокумента</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиКабинетСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДокумента</name>
    <type>
      <types>EnumRef.КатегорииДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписанСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДокументаСоответствуетТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайлаPDF_A_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПодписанты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Reports/ДокументыЭДОБЗКСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыНаПодписании");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет показывает сотрудников у которых есть не подписанные документы ЭДО'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыБезПодписиОрганизации");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет показывает документы ЭДО не подписанные со стороны организации'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыНеПереданныеСотрудникам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет показывает документы ЭДО созданные, но так и не перданные сотрудникам'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыПолностьюПодписанные");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет показывает документы ЭДО работа с которыми завершена'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КарточкаЭлектронногоДокумента");
	НастройкиВарианта.Описание = НСтр("ru = 'Формирует карточки документов ЭДО'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКомандыФормированияОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.ДокументыЭДОБЗКСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Документы на подписании'");
	Команда.Важность           = "Обычное";
	Команда.Менеджер           = "Отчет.ДокументыЭДОБЗКСотрудников";
	Команда.КлючВарианта       = "ДокументыНаПодписании";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.A, Ложь, Истина, Истина);
	Команда.Подменю            = "ДокументыЭДОБЗКСотрудников";
	Команда.Картинка           = БиблиотекаКартинок.Отчет;
	Команда.Назначение         = "ДляСписка";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Без подписи организации'");
	Команда.Важность           = "Обычное";
	Команда.Менеджер           = "Отчет.ДокументыЭДОБЗКСотрудников";
	Команда.КлючВарианта       = "ДокументыБезПодписиОрганизации";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.A, Ложь, Истина, Истина);
	Команда.Подменю            = "ДокументыЭДОБЗКСотрудников";
	Команда.Картинка           = БиблиотекаКартинок.Отчет;
	Команда.Назначение         = "ДляСписка";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Не переданные сотрудникам'");
	Команда.Важность           = "Обычное";
	Команда.Менеджер           = "Отчет.ДокументыЭДОБЗКСотрудников";
	Команда.КлючВарианта       = "ДокументыНеПереданныеСотрудникам";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.A, Ложь, Истина, Истина);
	Команда.Подменю            = "ДокументыЭДОБЗКСотрудников";
	Команда.Картинка           = БиблиотекаКартинок.Отчет;
	Команда.Назначение         = "ДляСписка";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Полностью подписанные'");
	Команда.Важность           = "Обычное";
	Команда.Менеджер           = "Отчет.ДокументыЭДОБЗКСотрудников";
	Команда.КлючВарианта       = "ДокументыПолностьюПодписанные";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.A, Ложь, Истина, Истина);
	Команда.Подменю            = "ДокументыЭДОБЗКСотрудников";
	Команда.Картинка           = БиблиотекаКартинок.Отчет;
	Команда.Назначение         = "ДляСписка";
	
КонецПроцедуры

Процедура ДобавитьКомандуПечати(КомандыПечати, ИдентификаторыПФ = Неопределено, СторонняяПечатнаяФорма = Ложь) Экспорт
	
	// Трудовой договор микропредприятий
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ДокументыЭДОБЗКСотрудников) Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ДокументыЭДОБЗКСотрудников";
		КомандаПечати.Идентификатор = "ПФ_MXL_КарточкаЭлектронногоДокумента";
		КомандаПечати.Представление = НСтр("ru = 'Карточка'");
		
		Если Не Пользователи.ЭтоПолноправныйПользователь() И ИдентификаторыПФ <> Неопределено Тогда
			ЗарплатаКадры.ДобавитьИдентификаторКомандыДляПечатиВПакетномРежиме(ИдентификаторыПФ, КомандаПечати);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Отборы = Новый Массив;
	Отборы.Добавить(
		Новый Структура("ЛевоеЗначение,ВидСравнения,ПравоеЗначение",
			"СсылкаНаОбъект",
			ВидСравненияКомпоновкиДанных.ВСписке,
			МассивОбъектов));
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Отбор", Отборы);
	
	ЗарплатаКадрыОтчеты.ВывестиВКоллекциюПечатнуюФорму("Отчет.ДокументыЭДОБЗКСотрудников",
		МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ВнешниеНаборыДанных(), ДополнительныеПараметры);
		
КонецПроцедуры

Процедура Сформировать(ДокументРезультат, РезультатКомпоновки, ОбъектыПечати = Неопределено, ПараметрыПечати = Неопределено) Экспорт

	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КарточкаЭлектронногоДокумента";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	Для Каждого ДанныеНаПечать Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПерваяСтрокаПечатнойФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
			
			ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(РезультатКомпоновки.ИдентификаторыМакета, ДанныеДетальныхЗаписей);
			
			ОбластиШапки = "Шапка,Основание,Свойства";
			Если ТипЗнч(ДанныеДетальныхЗаписей.СсылкаНаОбъектОснованиеДокумента) = Тип("ДокументСсылка.ДокументЭДОБЗК") Тогда
				ОбластиШапки = "Шапка,Свойства";
			КонецЕсли;
			ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
				ДокументРезультат,
				РезультатКомпоновки.МакетПечатнойФормы,
				ОбластиШапки,
				ДанныеНаПечать,
				ДанныеДетальныхЗаписей,
				ДанныеПользовательскихПолей);
				
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				
				ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультат,
					РезультатКомпоновки.МакетПечатнойФормы,
					"МероприятияШапка",
					ДанныеНаПечать,
					ДанныеДетальныхЗаписей,
					ДанныеПользовательскихПолей);
					
				Для Каждого СтрокаМероприятия Из ДанныеДетальныхЗаписей.Строки Цикл
					
					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
						ДокументРезультат,
						РезультатКомпоновки.МакетПечатнойФормы,
						"МероприятияСтрока",
						ДанныеНаПечать,
						СтрокаМероприятия,
						ДанныеПользовательскихПолей);
						
				КонецЦикла;
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("СсылкаНаОбъект", ДанныеНаПечать.СсылкаНаОбъект);
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ДокументЭДОБЗКВнешниеПодписанты.НомерСтроки КАК НомерСтроки,
				|	ДокументЭДОБЗКВнешниеПодписанты.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ДокументЭДОБЗКВнешниеПодписанты.ФизическоеЛицо.ФИО КАК КомуВыданСертификат,
				|	ИСТИНА КАК ПодписьСотрудника,
				|	ПодписиДокументовЭДОБЗК.Отпечаток КАК Отпечаток,
				|	ПодписиДокументовЭДОБЗК.ДатаПодписи КАК ДатаПодписи,
				|	ПодписиДокументовЭДОБЗК.РезультатСогласования КАК РезультатСогласования
				|ИЗ
				|	Документ.ДокументЭДОБЗК.ВнешниеПодписанты КАК ДокументЭДОБЗКВнешниеПодписанты
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписиДокументовЭДОБЗК КАК ПодписиДокументовЭДОБЗК
				|		ПО ДокументЭДОБЗКВнешниеПодписанты.Ссылка = ПодписиДокументовЭДОБЗК.Объект
				|			И ДокументЭДОБЗКВнешниеПодписанты.ФизическоеЛицо = ПодписиДокументовЭДОБЗК.ФизическоеЛицо
				|ГДЕ
				|	ДокументЭДОБЗКВнешниеПодписанты.Ссылка = &СсылкаНаОбъект";
			
			ПодписиОбъекта = Запрос.Выполнить().Выгрузить();
			ПодписиОбъекта.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
			ПодписиОбъекта.Колонки.Добавить("ПодписьВерна", Новый ОписаниеТипов("Булево"));
			ПодписиОбъекта.Колонки.Добавить("ДатаПроверкиПодписи", Новый ОписаниеТипов("Дата"));
			ПодписиОбъекта.Колонки.Добавить("РезультатПроверкиПодписи", Новый ОписаниеТипов("Строка"));
			ПодписиОбъекта.Колонки.Добавить("Доверенность", Новый ОписаниеТипов("Строка"));
			
			УстановленныеПодписи = ЭлектроннаяПодписьЭДОБЗК.УстановленныеПодписи(ДанныеНаПечать.СсылкаНаОбъектЭлектронныйДокумент);
			Для Каждого УстановленнаяПодпись Из УстановленныеПодписи Цикл
				
				Доверенность = "";
				Если ЗначениеЗаполнено(УстановленнаяПодпись.РезультатПроверкиПодписиПоМЧД) Тогда
					Доверенности = Новый Массив;
					Для Каждого МЧДПодписи Из УстановленнаяПодпись.РезультатПроверкиПодписиПоМЧД Цикл
						Доверенности.Добавить(Строка(МЧДПодписи.МашиночитаемаяДоверенность));
					КонецЦикла;
					Если Доверенности.Количество() = 1 Тогда
						Доверенность = СтрШаблон(НСтр("ru = 'Доверенность: %1'"), Доверенности[0]);
					Иначе
						Доверенность = СтрШаблон(НСтр("ru = 'Доверенности: %1'"), СтрСоединить(Доверенности, ", "));
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокиДокумента = ПодписиОбъекта.НайтиСтроки(Новый Структура("Отпечаток,ДатаПодписи", УстановленнаяПодпись.Отпечаток, УстановленнаяПодпись.ДатаПодписи));
				Если Не ЗначениеЗаполнено(СтрокиДокумента) Тогда
						СтрокаДокумента = ПодписиОбъекта.Добавить();
						СтрокаДокумента.ПодписьСотрудника = Ложь;
						СтрокаДокумента.ДатаПодписи = УстановленнаяПодпись.ДатаПодписи;
						СтрокаДокумента.РезультатСогласования = Перечисления.РезультатыСогласованияБЗК.Согласовано;
						СтрокаДокумента.Отпечаток = УстановленнаяПодпись.Отпечаток;
						СтрокаДокумента.КомуВыданСертификат = УстановленнаяПодпись.КомуВыданСертификат;
						СтрокаДокумента.ДатаПроверкиПодписи = УстановленнаяПодпись.ДатаПроверкиПодписи;
						СтрокаДокумента.ПодписьВерна = УстановленнаяПодпись.ПодписьВерна;
						СтрокаДокумента.Доверенность = Доверенность;
				Иначе
					Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
						СтрокаДокумента.КомуВыданСертификат = УстановленнаяПодпись.КомуВыданСертификат;
						СтрокаДокумента.ДатаПроверкиПодписи = УстановленнаяПодпись.ДатаПроверкиПодписи;
						СтрокаДокумента.ПодписьВерна = УстановленнаяПодпись.ПодписьВерна;
						СтрокаДокумента.Доверенность = Доверенность;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			ПодписиОбъекта.Сортировать("ПодписьСотрудника,НомерСтроки,ДатаПодписи");
			Для Каждого СтрокаПодписи Из ПодписиОбъекта Цикл
				ЗаполнитьСтатусПроверкиПодписиОбъекта(СтрокаПодписи);
				СтрокиРезультата = Новый Массив;
				СтрокиРезультата.Добавить(СтрокаПодписи.Статус);                                                           
				Если ЗначениеЗаполнено(СтрокаПодписи.ДатаПроверкиПодписи) Тогда
					СтрокиРезультата.Добавить(СтрокаПодписи.ДатаПроверкиПодписи);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПодписи.Доверенность) Тогда
					СтрокиРезультата.Добавить(СтрокаПодписи.Доверенность);
				КонецЕсли;
				СтрокаПодписи.РезультатПроверкиПодписи = СтрСоединить(СтрокиРезультата, ", ");
			КонецЦикла;
			
			ПодписиОтветсвенныхЛиц = ПодписиОбъекта.Скопировать(Новый Структура("ПодписьСотрудника", Ложь));
			Если ЗначениеЗаполнено(ПодписиОтветсвенныхЛиц) Тогда
				
				ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультат,
					РезультатКомпоновки.МакетПечатнойФормы,
					"ОтветственныеЛицаШапка",
					ДанныеНаПечать,
					ДанныеДетальныхЗаписей,
					ДанныеПользовательскихПолей);
					
				Для Каждого ПодписьОтветсвенногоЛица Из ПодписиОтветсвенныхЛиц Цикл
					
					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
						ДокументРезультат,
						РезультатКомпоновки.МакетПечатнойФормы,
						"ОтветственныеЛицаСтрока",
						ДанныеНаПечать,
						ПодписьОтветсвенногоЛица,
						ДанныеПользовательскихПолей);
						
				КонецЦикла;
					
			КонецЕсли;
			
			ПодписиСотрудников = ПодписиОбъекта.Скопировать(Новый Структура("ПодписьСотрудника", Истина));
			Если ЗначениеЗаполнено(ПодписиСотрудников) Тогда
				
				ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
					ДокументРезультат,
					РезультатКомпоновки.МакетПечатнойФормы,
					"СотрудникиШапка",
					ДанныеНаПечать,
					ДанныеДетальныхЗаписей,
					ДанныеПользовательскихПолей);
					
				Для Каждого ПодписьСотрудника Из ПодписиСотрудников Цикл
					
					ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
						ДокументРезультат,
						РезультатКомпоновки.МакетПечатнойФормы,
						"СотрудникиСтрока",
						ДанныеНаПечать,
						ПодписьСотрудника,
						ДанныеПользовательскихПолей);
						
				КонецЦикла;
					
			КонецЕсли;
		
		КонецЦикла;
			
		Если ОбъектыПечати <> Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаПечатнойФормы, ОбъектыПечати, ДанныеНаПечать.СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтатусПроверкиПодписиОбъекта(Объект) Экспорт
	
	Если Объект.ПодписьВерна Тогда
		Объект.Статус = НСтр("ru = 'Верна'");
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаПроверкиПодписи) Тогда
		Объект.Статус = НСтр("ru = 'Неверна'");
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаПодписи) Тогда
		Если ЗначениеЗаполнено(Объект.Отпечаток) Тогда
			Объект.Статус = НСтр("ru = 'Не проверялась'");
		Иначе
			Объект.Статус = НСтр("ru = 'Требуется собственноручная подпись'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВнешниеНаборыДанных() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомментарииФайловДокументовЭДОБЗК.ПрисоединенныйФайл КАК ПрисоединенныйФайл,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(КомментарииФайловДокументовЭДОБЗК.Исполнитель) = ТИП(Справочник.ФизическиеЛица)
		|			ТОГДА КомментарииФайловДокументовЭДОБЗК.Исполнитель
		|		ИНАЧЕ КомментарииФайловДокументовЭДОБЗК.Исполнитель.ФизическоеЛицо
		|	КОНЕЦ КАК Исполнитель,
		|	КомментарииФайловДокументовЭДОБЗК.Комментарий КАК Комментарий,
		|	КомментарииФайловДокументовЭДОБЗК.ДатаКомментария КАК ДатаКомментария
		|ИЗ
		|	РегистрСведений.КомментарииФайловДокументовЭДОБЗК КАК КомментарииФайловДокументовЭДОБЗК";
	
	УстановитьПривилегированныйРежим(Истина);
	ВнешниеНаборы = Новый Структура("КомментарииЭлектронныхДокументов",  Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВнешниеНаборы
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
